[
    {
      "id": 1,
      "title": "Вітамін А",
      "photo": "",
      "description": "Вітамін A – це жиророзчинний вітамін, необхідний для здоров’я зору, імунної системи та росту клітин. Він міститься у двох формах: ретинол (у продуктах тваринного походження) та каротиноїди (у рослинних джерелах, таких як морква, гарбуз, шпинат). Дефіцит вітаміну A може спричинити проблеми із зором, сухість шкіри та зниження імунітету.",
      "rating": 5,
      "type": "ліки"
    },
    {
      "id": 2,
      "title": "Вітамін С",
      "photo": "",
      "description": "Вітамін C – водорозчинний вітамін, що діє як потужний антиоксидант, зміцнює імунітет, сприяє загоєнню ран і засвоєнню заліза. Міститься у цитрусових, ягодах, ківі, перці та броколі. Дефіцит може викликати слабкість, кровоточивість ясен і повільне загоєння ран.",
      "rating": 4,
      "type": "ліки"
    },
    {
      "id": 3,
      "title": "Вітамін D",
      "photo": "",
      "description": "Вітамін D – жиророзчинний вітамін, необхідний для здоров'я кісток та зубів, оскільки сприяє засвоєнню кальцію. Організм виробляє його під впливом сонячного світла, а також отримує з риби, яєць і молочних продуктів. Недостатність вітаміну D може призвести до ослаблення імунітету та проблем з кістками.",
      "rating": 5,
      "type": "ліки"
    },
    {
      "id": 4,
      "title": "Вітамін B3",
      "photo": "",
      "description": "Вітамін B3 (ніацин) – водорозчинний вітамін, що підтримує енергетичний обмін, здоров’я шкіри, нервової системи та серця. Його джерела – м’ясо, риба, горіхи, злаки та бобові. Дефіцит може спричинити втому, депресію та захворювання пелагру.",
      "rating": 3,
      "type": "ліки"
    },
    {
      "id": 5,
      "title": "Омега-3",
      "photo": "",
      "description": "Омега-3 – це незамінні жирні кислоти, необхідні для здоров’я серця, мозку та суглобів. Вони зменшують запалення, підтримують роботу нервової системи та покращують стан шкіри. Основні джерела – жирна риба (лосось, оселедець, скумбрія), лляне насіння, чіа та горіхи. Дефіцит може призводити до підвищеного ризику серцевих захворювань і порушень когнітивних функцій.",
      "rating": 4,
      "type": "ліки"
    },
    {
      "id": 6,
      "title": "Magnesium",
      "photo": "",
      "description": "Магній – це важливий мінерал, що підтримує роботу м’язів, нервової системи та серця, а також сприяє зміцненню кісток. Він допомагає зменшити стрес, покращує сон і нормалізує рівень цукру в крові. Магній міститься у горіхах, насінні, зелених овочах, бананах і темному шоколаді. Недостатність магнію може викликати судоми, втому та дратівливість.",
      "rating": 3,
      "type": "ліки"
    }
  ]
  